# 01 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np 
import requests
import json

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', low_memory=False, index_col='user_id') #hacer lo de low memory al utilizar read csv lo lee todo como lo tiene que leer por que por lo normal omite alguns decimales o filas 
# users = users.set_index("user_id") esta es otra manera de asignar user id es lo mismo que index_col
# users.set_index("user_id", inplace = True) es lo mismo que igual la variable. por que inplace por defecto esta en False
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries
Solve it by 2 different ways

In [4]:
users.loc[:25] #loc es hasta el 25 incluido

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [4]:
users.iloc[:25]   #iloc no es incluido

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [5]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [7]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?
Solve it by 2 different ways

In [6]:
pd.set_option('display.max_columns',None) #cambia para que se vea cuando mostremos las columnas se muestre el maximo

In [36]:
print("observations", users.shape[0])

observations 943

In [40]:
print("observations", len(users))

observations 943

In [10]:
users.size

3772

In [7]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

### Step 7. What is the number of columns in the dataset?
Solve it by 2 different ways

In [41]:
print("cols: ", len(users.columns))

cols:  4

In [42]:
print("cols: ", users.shape[1])

cols:  4

### Step 8. Print the name of all the columns.

In [16]:
print(list(users.columns))

['age', 'gender', 'occupation', 'zip_code']

### Step 9. How is the dataset indexed? Get the index values

In [43]:
print("Dataset index info:",users.index)

Dataset index info: Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?
Solve it by 2 different ways

In [20]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [8]:
for col in users.columns:
    print(users[col].values.type)

AttributeError: 'numpy.ndarray' object has no attribute 'type'

In [21]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 11. Print only the occupation column
Solve it by 2 different ways

In [22]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [13]:
users.loc[:,['occupation']] #esto es para imprimir como data frame

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [14]:
users.iloc[:,[2]]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [16]:
users.iloc[:,2:3]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

### Step 12. How many different occupations are in this dataset? How many users per occupation are in the dataset?

In [44]:
print("num of different occupations",users['occupation'].nunique())

num of different occupations 21

In [17]:
users.loc[:,'occupation'].unique() #este no te los cuenta

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [ ]:
#El none si en vez de np.nan le ponemos none lo pone como columna en unique aparece el none, pero al poner el unique no lo suma y salen 21 columnas. Pands interpreta como nan por que el none para numpy es nan y pandas usa numpy

In [19]:
#si queremos hacer modificaciones 

users2 = users.copy ()

In [ ]:
users2.loc[1,'occupation'] = np.nan

In [21]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [22]:
users['occupation'].value_counts()['programmer']

66

In [25]:
#Si quiero que pandas me de los trabajos que tienen 66
# una mascara sirve para filtrar
occupations = users['occupation'].value_counts()
occupations[occupations == 66]

programmer    66
Name: occupation, dtype: int64

In [26]:
#Esto es para que me salga como dataframe
occupations = users['occupation'].value_counts()
pd.DataFrame(occupations[occupations == 66])

            occupation
programmer          66

### Step 13. What is the most frequent occupation?

In [53]:

print('The most frequent occupation is ', users['occupation'].value_counts().idxmax())

The most frequent occupation is  student

In [29]:
users['occupation'].value_counts()[:1]

student    196
Name: occupation, dtype: int64

In [30]:
pd.DataFrame(users['occupation'].value_counts()[:1])

         occupation
student         196

In [32]:
#Preguntando por el maximo
users['occupation'].value_counts().max()

196

In [35]:
users['occupation'].value_counts()[users['occupation'].value_counts() ==users['occupation'].value_counts().max()]

student    196
Name: occupation, dtype: int64

In [37]:
users['occupation'].describe()['top']

'student'

In [38]:
users['occupation'].mode()[0]

'student'

In [39]:
#cuando quiero el minimo y ordenar de menor a mayor
users['occupation'].value_counts().sort_values(ascending=True)

homemaker          7
doctor             7
none               9
salesman          12
lawyer            12
retired           14
healthcare        16
entertainment     18
marketing         26
technician        27
artist            28
scientist         31
executive         32
writer            45
librarian         51
programmer        66
engineer          67
administrator     79
educator          95
other            105
student          196
Name: occupation, dtype: int64

In [42]:
users[users['occupation'] == users['occupation'].value_counts().sort_values(ascending=True).min()]

Empty DataFrame
Columns: [age, gender, occupation, zip_code]
Index: []

In [43]:
serie_larga = users['occupation'].value_counts().sort_values(ascending=True)

In [45]:
#para que me de la serie de los valores minimos. Esto se llama mascaras

serie_larga[serie_larga == users['occupation'].value_counts().sort_values(ascending=True).min()]

homemaker    7
doctor       7
Name: occupation, dtype: int64

In [47]:
pd.DataFrame(serie_larga)

               occupation
homemaker               7
doctor                  7
none                    9
salesman               12
lawyer                 12
retired                14
healthcare             16
entertainment          18
marketing              26
technician             27
artist                 28
scientist              31
executive              32
writer                 45
librarian              51
programmer             66
engineer               67
administrator          79
educator               95
other                 105
student               196

### Step 14. Summarize the DataFrame.

In [54]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [ ]:
# el count no nos cuenta los NAN, si contamos la base de datos que tiene los NAN se ve que no nos cuenta

In [55]:
users.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [59]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [48]:
print('The mean age of users is:',  users['age'].mean())

TypeError: type str doesn't define __round__ method

### Step 18. What is the age with least occurrence?

In [63]:

print('The age with least occurrence is:', users['age'].value_counts().idxmin())

The age with least occurrence is: 7

In [49]:
users['age'].value_counts().tail()

7     1
66    1
10    1
11    1
73    1
Name: age, dtype: int64